
## Terraform Plan of GCP
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
google_cloud_run_service.attendance_request_bot: Refreshing state... [id=locations/asia-northeast1/namespaces/igsr5-368506/services/attendance-request-bot]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_iam_policy.attendance_request_scheduler_sa_invoker will be read during apply
  # (config refers to values not yet known)
 <= data "google_iam_policy" "attendance_request_scheduler_sa_invoker" {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + (known after apply),
            ]
          + role    = "roles/run.invoker"
        }
    }

  # data.google_iam_policy.igsr5_daily_invoker will be read during apply
  # (config refers to values not yet known)
 <= data "google_iam_policy" "igsr5_daily_invoker" {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + (known after apply),
            ]
          + role    = "roles/run.invoker"
        }
    }

  # google_cloud_run_service.igsr5_daily will be created
  + resource "google_cloud_run_service" "igsr5_daily" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "asia-northeast1"
      + name                       = "igsr5_daily"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + labels           = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "us-docker.pkg.dev/cloudrun/container/hello"

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits   = (known after apply)
                      + requests = (known after apply)
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
          + tag             = (known after apply)
          + url             = (known after apply)
        }
    }

  # google_cloud_run_service_iam_policy.attendance_request_scheduler_sa_policy will be created
  + resource "google_cloud_run_service_iam_policy" "attendance_request_scheduler_sa_policy" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "asia-northeast1"
      + policy_data = (known after apply)
      + project     = (known after apply)
      + service     = "attendance-request-bot"
    }

  # google_cloud_run_service_iam_policy.igsr5_daily_sa_policy will be created
  + resource "google_cloud_run_service_iam_policy" "igsr5_daily_sa_policy" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "asia-northeast1"
      + policy_data = (known after apply)
      + project     = (known after apply)
      + service     = "igsr5_daily"
    }

  # google_cloud_scheduler_job.attendance_request_bot will be created
  + resource "google_cloud_scheduler_job" "attendance_request_bot" {
      + attempt_deadline = "600s"
      + description      = "Sends a message to the attendance-request-bot channel"
      + id               = (known after apply)
      + name             = "attendance-request-bot"
      + paused           = (known after apply)
      + project          = (known after apply)
      + region           = (known after apply)
      + schedule         = "45 10 * * 1"
      + state            = (known after apply)
      + time_zone        = "Asia/Tokyo"

      + http_target {
          + http_method = "POST"
          + uri         = "https://attendance-request-bot-ibzykqu2gq-an.a.run.app"

          + oidc_token {
              + audience              = "https://attendance-request-bot-ibzykqu2gq-an.a.run.app"
              + service_account_email = (known after apply)
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 3
        }
    }

  # google_cloud_scheduler_job.igsr5_daily will be created
  + resource "google_cloud_scheduler_job" "igsr5_daily" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "igsr5_daily"
      + paused           = (known after apply)
      + project          = (known after apply)
      + region           = (known after apply)
      + schedule         = "0 18 * * *"
      + state            = (known after apply)
      + time_zone        = "Asia/Tokyo"

      + http_target {
          + http_method = "POST"
          + uri         = (known after apply)

          + oidc_token {
              + audience              = "https://attendance-request-bot-ibzykqu2gq-an.a.run.app"
              + service_account_email = (known after apply)
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 3
        }
    }

  # google_service_account.attendance_request_scheduler_sa will be created
  + resource "google_service_account" "attendance_request_scheduler_sa" {
      + account_id   = "cloud-run-invoker-sa"
      + disabled     = false
      + display_name = "Cloud Run Invoker Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_service_account.igsr5_daily_sa will be created
  + resource "google_service_account" "igsr5_daily_sa" {
      + account_id   = "cloud-run-invoker-sa"
      + disabled     = false
      + display_name = "Cloud Run Invoker Service Account"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @igsr5, Action: `pull_request`*